In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
dict1={
    "name":["tanishka","doll","payal","madhu"],
    "marks":[98,97,99,100],
    "city":["delhi","rampur","nagaland","us"]
}

In [4]:
df=pd.DataFrame(dict1)
df

       name  marks      city
0  tanishka     98     delhi
1      doll     97    rampur
2     payal     99  nagaland
3     madhu    100        us

In [5]:
df.to_csv('friends.csv')
# df.to_csv('friends.csv', index=False)           will not show index in excel file like 0,1,2,3...  this

WHEN DATA IS VERY LARGE WE USE df.head() or df.tail() to see the first few rows or last few rows respectively.
Additionally we can also specify the number of rows we want to see in the parenthesis like this:
df.head(3)
df.tail(2)

In [6]:
df.head()

       name  marks      city
0  tanishka     98     delhi
1      doll     97    rampur
2     payal     99  nagaland
3     madhu    100        us

In [7]:
df.tail()

       name  marks      city
0  tanishka     98     delhi
1      doll     97    rampur
2     payal     99  nagaland
3     madhu    100        us

In [8]:
df.head(2)

       name  marks    city
0  tanishka     98   delhi
1      doll     97  rampur

In [9]:
df.tail(3)

    name  marks      city
1   doll     97    rampur
2  payal     99  nagaland
3  madhu    100        us

In [10]:
df.tail(2)

    name  marks      city
2  payal     99  nagaland
3  madhu    100        us

TO DO A STATISTICAL ANALYSIS OF ALL NUMERICAL COLUMNS IN OUR CSV WE CAN USE DESCRIBE FUNCTION:
df.describe()

In [11]:
df.describe()

            marks
count    4.000000
mean    98.500000
std      1.290994
min     97.000000
25%     97.750000
50%     98.500000
75%     99.250000
max    100.000000

In [12]:
df

       name  marks      city
0  tanishka     98     delhi
1      doll     97    rampur
2     payal     99  nagaland
3     madhu    100        us

ACCESSING ELEMENTS OF EACH ROW AND COLUMN

In [13]:
df['name']

0    tanishka
1        doll
2       payal
3       madhu
Name: name, dtype: object

In [14]:
df['name'][0]

'tanishka'

In [15]:
df['marks'][0]

np.int64(98)

In [16]:
df['marks'][0]=100
# even though we get a warning our data will be changed. (We will learn later why we are getting an error)

C:\Users\tanis\AppData\Local\Temp\ipykernel_9016\4274300345.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['marks'][0]=100
C:\Users\tanis\AppData\Local\Temp\ipykernel_9016\4274300345.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['marks'][0]=100

In [17]:
df

       name  marks      city
0  tanishka    100     delhi
1      doll     97    rampur
2     payal     99  nagaland
3     madhu    100        us

In [18]:
df.to_csv('friends.csv')

In [19]:
df.index=['FIRST','SECOND','THIRD','FOURTH']
df

            name  marks      city
FIRST   tanishka    100     delhi
SECOND      doll     97    rampur
THIRD      payal     99  nagaland
FOURTH     madhu    100        us

TO READ ANOTHER (OUTSIDE) CSV FILE

In [20]:
ds=pd.read_csv('sample.csv')
ds

,title,description,level,goal,equipment,program_length,time_per_workout,total_exercises,created,last_edit
0,(MASS MONSTER) High Intensity 4 Day Upper Lowe...,Build tones of muscular with this high intensi...,['Intermediate'],"['Muscle & Sculpting', 'Bodyweight Fitness']",Full Gym,12.0,90.0,384,2024-01-20 10:23:00,2025-06-29 12:39:00
1,(NOT MY PROGRAM)SHJ Jotaro,Build strength and size,"['Advanced', 'Intermediate']",['Bodybuilding'],Full Gym,8.0,60.0,224,2024-07-08 02:28:00,2025-06-18 09:15:00
2,1 PowerLift Per Day Powerbuilding 5 Day Bro Split,Based off of Andy Baker's KCS (Kingwood Streng...,"['Beginner', 'Novice', 'Intermediate']","['Athletics', 'Powerlifting', 'Powerbuilding']",Full Gym,6.0,90.0,237,2025-04-23 09:21:00,2025-06-18 11:55:00
3,10 Week Mass Building Program,This workout is designed to increase your musc...,"['Intermediate', 'Advanced']",['Powerbuilding'],Garage Gym,10.0,70.0,280,2024-09-07 03:44:00,2025-06-18 08:01:00
4,10 week deadlift focus,Increase deadlift,"['Intermediate', 'Advanced']","['Powerbuilding', 'Powerlifting', 'Bodybuildin...",Full Gym,10.0,80.0,356,2024-12-23 03:13:00,2025-06-18 12:19:00
...,...,...,...,...,...,...,...,...,...,...
2593,üéß,Lihaskasvu,"['Intermediate', 'Advanced']",['Bodybuilding'],Garage Gym,12.0,90.0,228,2024-10-10 04:20:00,2025-06-18 11:32:00
2594,üëæReza's Routineüëæ,This is a beginner friendly routine made for m...,"['Beginner', 'Intermediate']",['Muscle & Sculpting'],Dumbbell Only,1.0,60.0,60,2024-09-15 08:45:00,2025-06-18 07:48:00
2595,"üî• ""Upper Body Dominance: 3-Day Growth System"" üî•","""Upper Body Dominance: A science-based 3-day w...","['Intermediate', 'Novice']",['Muscle & Sculpting'],Full Gym,6.0,60.0,96,2025-02-15 08:18:00,2025-06-18 07:48:00
2596,üôàüôâüôäüêµ,Muscle Memory Training,['Intermediate'],['Bodybuilding'],Full Gym,8.0,90.0,211,2024-12-08 01:04:00,2025-06-18 11:35:00
2597,ü•∑ü•∑ü•∑,To become stronger without becoming ‚Äúbulky‚Äù,"['Intermediate', 'Novice']","['Bodybuilding', 'Powerbuilding']",Garage Gym,9.0,100.0,216,2025-05-15 10:44:00,2025-06-18 12:08:00

In [21]:
ds.head(5)

,title,description,level,goal,equipment,program_length,time_per_workout,total_exercises,created,last_edit
0,(MASS MONSTER) High Intensity 4 Day Upper Lowe...,Build tones of muscular with this high intensi...,['Intermediate'],"['Muscle & Sculpting', 'Bodyweight Fitness']",Full Gym,12.0,90.0,384,2024-01-20 10:23:00,2025-06-29 12:39:00
1,(NOT MY PROGRAM)SHJ Jotaro,Build strength and size,"['Advanced', 'Intermediate']",['Bodybuilding'],Full Gym,8.0,60.0,224,2024-07-08 02:28:00,2025-06-18 09:15:00
2,1 PowerLift Per Day Powerbuilding 5 Day Bro Split,Based off of Andy Baker's KCS (Kingwood Streng...,"['Beginner', 'Novice', 'Intermediate']","['Athletics', 'Powerlifting', 'Powerbuilding']",Full Gym,6.0,90.0,237,2025-04-23 09:21:00,2025-06-18 11:55:00
3,10 Week Mass Building Program,This workout is designed to increase your musc...,"['Intermediate', 'Advanced']",['Powerbuilding'],Garage Gym,10.0,70.0,280,2024-09-07 03:44:00,2025-06-18 08:01:00
4,10 week deadlift focus,Increase deadlift,"['Intermediate', 'Advanced']","['Powerbuilding', 'Powerlifting', 'Bodybuildin...",Full Gym,10.0,80.0,356,2024-12-23 03:13:00,2025-06-18 12:19:00

In [22]:
ds['description']

0       Build tones of muscular with this high intensi...
1                                 Build strength and size
2       Based off of Andy Baker's KCS (Kingwood Streng...
3       This workout is designed to increase your musc...
4                                       Increase deadlift
                              ...
2593                                           Lihaskasvu
2594    This is a beginner friendly routine made for m...
2595    "Upper Body Dominance: A science-based 3-day w...
2596                               Muscle Memory Training
2597          To become stronger without becoming ‚Äúbulky‚Äù
Name: description, Length: 2598, dtype: object

In [23]:
ds['description'][4]

'Increase deadlift'

In [24]:
ds['description'][4]="increase deadlift"

C:\Users\tanis\AppData\Local\Temp\ipykernel_9016\2440316327.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ds['description'][4]="increase deadlift"

In [25]:
ds.head()

,title,description,level,goal,equipment,program_length,time_per_workout,total_exercises,created,last_edit
0,(MASS MONSTER) High Intensity 4 Day Upper Lowe...,Build tones of muscular with this high intensi...,['Intermediate'],"['Muscle & Sculpting', 'Bodyweight Fitness']",Full Gym,12.0,90.0,384,2024-01-20 10:23:00,2025-06-29 12:39:00
1,(NOT MY PROGRAM)SHJ Jotaro,Build strength and size,"['Advanced', 'Intermediate']",['Bodybuilding'],Full Gym,8.0,60.0,224,2024-07-08 02:28:00,2025-06-18 09:15:00
2,1 PowerLift Per Day Powerbuilding 5 Day Bro Split,Based off of Andy Baker's KCS (Kingwood Streng...,"['Beginner', 'Novice', 'Intermediate']","['Athletics', 'Powerlifting', 'Powerbuilding']",Full Gym,6.0,90.0,237,2025-04-23 09:21:00,2025-06-18 11:55:00
3,10 Week Mass Building Program,This workout is designed to increase your musc...,"['Intermediate', 'Advanced']",['Powerbuilding'],Garage Gym,10.0,70.0,280,2024-09-07 03:44:00,2025-06-18 08:01:00
4,10 week deadlift focus,increase deadlift,"['Intermediate', 'Advanced']","['Powerbuilding', 'Powerlifting', 'Bodybuildin...",Full Gym,10.0,80.0,356,2024-12-23 03:13:00,2025-06-18 12:19:00

CREATING A DATAFRAME OUT OF RANDOM NUMBERS IN A RANGE:

In [26]:
new_df=pd.DataFrame(np.random.random((300,5)), index=np.arange(300))

type(new_df)
new_df

            0         1         2         3         4
0    0.871730  0.089835  0.847709  0.951521  0.161630
1    0.251211  0.638972  0.481751  0.638470  0.192245
2    0.879449  0.899123  0.509577  0.872960  0.893401
3    0.492929  0.910274  0.098391  0.691656  0.346590
4    0.947001  0.793172  0.769571  0.535454  0.567428
..        ...       ...       ...       ...       ...
295  0.574922  0.872633  0.175556  0.557064  0.645949
296  0.682334  0.737660  0.414143  0.886655  0.328290
297  0.716609  0.729085  0.383762  0.515982  0.705994
298  0.909928  0.693864  0.268478  0.449283  0.530372
299  0.477445  0.559348  0.186028  0.367023  0.500859

[300 rows x 5 columns]

In [27]:
print(type(pd.Series(np.random.random(10))))

<class 'pandas.core.series.Series'>

In [28]:
new_df.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       290, 291, 292, 293, 294, 295, 296, 297, 298, 299],
      dtype='int64', length=300)

In [29]:
new_df[0][0]

np.float64(0.8717304189976353)

In [30]:
new_df[0][0]="tanishka"

C:\Users\tanis\AppData\Local\Temp\ipykernel_9016\3347093448.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  new_df[0][0]="tanishka"
C:\Users\tanis\AppData\Local\Temp\ipykernel_9016\3347093448.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'tanishka' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  new_df[0][0]="tanishka"

In [31]:
new_df

            0         1         2         3         4
0    tanishka  0.089835  0.847709  0.951521  0.161630
1    0.251211  0.638972  0.481751  0.638470  0.192245
2    0.879449  0.899123  0.509577  0.872960  0.893401
3    0.492929  0.910274  0.098391  0.691656  0.346590
4    0.947001  0.793172  0.769571  0.535454  0.567428
..        ...       ...       ...       ...       ...
295  0.574922  0.872633  0.175556  0.557064  0.645949
296  0.682334  0.737660  0.414143  0.886655  0.328290
297  0.716609  0.729085  0.383762  0.515982  0.705994
298  0.909928  0.693864  0.268478  0.449283  0.530372
299  0.477445  0.559348  0.186028  0.367023  0.500859

[300 rows x 5 columns]

In [32]:

new_df.dtypes[0]

dtype('O')

In [33]:
new_df.dtypes[1]

dtype('float64')

TO CONVERT A DATAFRAME TO NUMPY ARRAY:

In [34]:
nparr=new_df.to_numpy()
nparr

array([['tanishka', 0.0898348977915896, 0.8477088094376519,
        0.9515214753956147, 0.16162955515037924],
       [0.25121104492181434, 0.6389723106593901, 0.4817513724003738,
        0.6384703505141572, 0.1922446084459305],
       [0.8794486321338478, 0.8991226773629053, 0.509577207097684,
        0.8729597348572051, 0.893401208242633],
       ...,
       [0.7166086675610989, 0.7290848370225892, 0.383761650243979,
        0.5159816843226038, 0.705994329898588],
       [0.9099275819870355, 0.6938637987106123, 0.26847776462399897,
        0.449282716484105, 0.5303720902753152],
       [0.4774445212760028, 0.5593475724535272, 0.18602781151175518,
        0.3670231237466286, 0.5008590373414717]],
      shape=(300, 5), dtype=object)

In [35]:
new_df.head(5)

          0         1         2         3         4
0  tanishka  0.089835  0.847709  0.951521  0.161630
1  0.251211  0.638972  0.481751  0.638470  0.192245
2  0.879449  0.899123  0.509577  0.872960  0.893401
3  0.492929  0.910274  0.098391  0.691656  0.346590
4  0.947001  0.793172  0.769571  0.535454  0.567428

SORTING

In [36]:
new_df.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.161630  0.951521  0.847709  0.089835  tanishka
1    0.192245  0.638470  0.481751  0.638972  0.251211
2    0.893401  0.872960  0.509577  0.899123  0.879449
3    0.346590  0.691656  0.098391  0.910274  0.492929
4    0.567428  0.535454  0.769571  0.793172  0.947001
..        ...       ...       ...       ...       ...
295  0.645949  0.557064  0.175556  0.872633  0.574922
296  0.328290  0.886655  0.414143  0.737660  0.682334
297  0.705994  0.515982  0.383762  0.729085  0.716609
298  0.530372  0.449283  0.268478  0.693864  0.909928
299  0.500859  0.367023  0.186028  0.559348  0.477445

[300 rows x 5 columns]

TRANSPOSING A MATRIX

In [37]:
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,290,291,292,293,294,295,296,297,298,299
0,tanishka,0.251211,0.879449,0.492929,0.947001,0.106764,0.90849,0.094872,0.34016,0.303694,...,0.154631,0.125093,0.728685,0.375878,0.081684,0.574922,0.682334,0.716609,0.909928,0.477445
1,0.089835,0.638972,0.899123,0.910274,0.793172,0.243854,0.840204,0.278687,0.397954,0.491421,...,0.066819,0.667909,0.631295,0.880258,0.377024,0.872633,0.73766,0.729085,0.693864,0.559348
2,0.847709,0.481751,0.509577,0.098391,0.769571,0.968585,0.12248,0.326663,0.321997,0.222725,...,0.161383,0.380868,0.683378,0.665249,0.770937,0.175556,0.414143,0.383762,0.268478,0.186028
3,0.951521,0.63847,0.87296,0.691656,0.535454,0.227357,0.621559,0.956544,0.49854,0.159409,...,0.53097,0.209717,0.390996,0.122248,0.022749,0.557064,0.886655,0.515982,0.449283,0.367023
4,0.16163,0.192245,0.893401,0.34659,0.567428,0.351031,0.014889,0.765066,0.662637,0.193623,...,0.942048,0.386019,0.286297,0.542384,0.945536,0.645949,0.32829,0.705994,0.530372,0.500859

In [38]:
new_df[0][0]=0.657478
new_df

            0         1         2         3         4
0    0.657478  0.089835  0.847709  0.951521  0.161630
1    0.251211  0.638972  0.481751  0.638470  0.192245
2    0.879449  0.899123  0.509577  0.872960  0.893401
3    0.492929  0.910274  0.098391  0.691656  0.346590
4    0.947001  0.793172  0.769571  0.535454  0.567428
..        ...       ...       ...       ...       ...
295  0.574922  0.872633  0.175556  0.557064  0.645949
296  0.682334  0.737660  0.414143  0.886655  0.328290
297  0.716609  0.729085  0.383762  0.515982  0.705994
298  0.909928  0.693864  0.268478  0.449283  0.530372
299  0.477445  0.559348  0.186028  0.367023  0.500859

[300 rows x 5 columns]

In [39]:
type(new_df[0])

pandas.core.series.Series

view: 
newdf2 is like  pointer to original dataframe and any changes made to newdf2 will reflect on new_df as well.

In [40]:
newdf2=new_df
newdf2[0][0]="hello"
newdf2

            0         1         2         3         4
0       hello  0.089835  0.847709  0.951521  0.161630
1    0.251211  0.638972  0.481751  0.638470  0.192245
2    0.879449  0.899123  0.509577  0.872960  0.893401
3    0.492929  0.910274  0.098391  0.691656  0.346590
4    0.947001  0.793172  0.769571  0.535454  0.567428
..        ...       ...       ...       ...       ...
295  0.574922  0.872633  0.175556  0.557064  0.645949
296  0.682334  0.737660  0.414143  0.886655  0.328290
297  0.716609  0.729085  0.383762  0.515982  0.705994
298  0.909928  0.693864  0.268478  0.449283  0.530372
299  0.477445  0.559348  0.186028  0.367023  0.500859

[300 rows x 5 columns]

In [41]:
new_df

            0         1         2         3         4
0       hello  0.089835  0.847709  0.951521  0.161630
1    0.251211  0.638972  0.481751  0.638470  0.192245
2    0.879449  0.899123  0.509577  0.872960  0.893401
3    0.492929  0.910274  0.098391  0.691656  0.346590
4    0.947001  0.793172  0.769571  0.535454  0.567428
..        ...       ...       ...       ...       ...
295  0.574922  0.872633  0.175556  0.557064  0.645949
296  0.682334  0.737660  0.414143  0.886655  0.328290
297  0.716609  0.729085  0.383762  0.515982  0.705994
298  0.909928  0.693864  0.268478  0.449283  0.530372
299  0.477445  0.559348  0.186028  0.367023  0.500859

[300 rows x 5 columns]

In [42]:
new_df[0][1]="TANISHKA"
newdf2

            0         1         2         3         4
0       hello  0.089835  0.847709  0.951521  0.161630
1    TANISHKA  0.638972  0.481751  0.638470  0.192245
2    0.879449  0.899123  0.509577  0.872960  0.893401
3    0.492929  0.910274  0.098391  0.691656  0.346590
4    0.947001  0.793172  0.769571  0.535454  0.567428
..        ...       ...       ...       ...       ...
295  0.574922  0.872633  0.175556  0.557064  0.645949
296  0.682334  0.737660  0.414143  0.886655  0.328290
297  0.716609  0.729085  0.383762  0.515982  0.705994
298  0.909928  0.693864  0.268478  0.449283  0.530372
299  0.477445  0.559348  0.186028  0.367023  0.500859

[300 rows x 5 columns]

AS SEEN ABOVE ANY CHANGES IN new_df will be reflected on newdf2 as well

COPY: 
ALL THE DATA IS COPIED IN ANOTHER VARIABLE USING 2 METHODS:
1) newdf2=new_df[:]       (shallow copy --> row and coloumn is copied but data cell points to the original dataframe. i.e., changing the data will change original array as well)

2) newdf=new_df.copy      (deep copy --> everything will be copied. therefore, changing data cells here wil not change the original data frame)

In [43]:
newdf3=new_df[:]
newdf3[0][0]="vadakam"     #data will get changed in original data frame as well
new_df.head()

C:\Users\tanis\AppData\Local\Temp\ipykernel_9016\1186376919.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf3[0][0]="vadakam"     #data will get changed in original data frame as well
C:\Users\tanis\AppData\Local\Temp\ipykernel_9016\1186376919.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf3[0][0]="vadakam"     #data will get changed in original data frame as well

          0         1         2         3         4
0   vadakam  0.089835  0.847709  0.951521  0.161630
1  TANISHKA  0.638972  0.481751  0.638470  0.192245
2  0.879449  0.899123  0.509577  0.872960  0.893401
3  0.492929  0.910274  0.098391  0.691656  0.346590
4  0.947001  0.793172  0.769571  0.535454  0.567428

In [44]:
newdf2=new_df.copy()
newdf2[0][1]="baingan"      # data will not be changed in the original dataframe
newdf2.head()

C:\Users\tanis\AppData\Local\Temp\ipykernel_9016\1839558333.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf2[0][1]="baingan"      # data will not be changed in the original dataframe
C:\Users\tanis\AppData\Local\Temp\ipykernel_9016\1839558333.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][1]="baingan"      # data will not be changed in the original dataframe

          0         1         2         3         4
0   vadakam  0.089835  0.847709  0.951521  0.161630
1   baingan  0.638972  0.481751  0.638470  0.192245
2  0.879449  0.899123  0.509577  0.872960  0.893401
3  0.492929  0.910274  0.098391  0.691656  0.346590
4  0.947001  0.793172  0.769571  0.535454  0.567428

In [45]:
new_df.head()

          0         1         2         3         4
0   vadakam  0.089835  0.847709  0.951521  0.161630
1  TANISHKA  0.638972  0.481751  0.638470  0.192245
2  0.879449  0.899123  0.509577  0.872960  0.893401
3  0.492929  0.910274  0.098391  0.691656  0.346590
4  0.947001  0.793172  0.769571  0.535454  0.567428

CORRECT WAY OF CHANGING VALUES IN AN CELL USING LOC:
new_df.loc[row,col]="value"

In [46]:
new_df.head()

          0         1         2         3         4
0   vadakam  0.089835  0.847709  0.951521  0.161630
1  TANISHKA  0.638972  0.481751  0.638470  0.192245
2  0.879449  0.899123  0.509577  0.872960  0.893401
3  0.492929  0.910274  0.098391  0.691656  0.346590
4  0.947001  0.793172  0.769571  0.535454  0.567428

In [47]:
new_df.loc[0,0]="hello"           # no warning
new_df

            0         1         2         3         4
0       hello  0.089835  0.847709  0.951521  0.161630
1    TANISHKA  0.638972  0.481751  0.638470  0.192245
2    0.879449  0.899123  0.509577  0.872960  0.893401
3    0.492929  0.910274  0.098391  0.691656  0.346590
4    0.947001  0.793172  0.769571  0.535454  0.567428
..        ...       ...       ...       ...       ...
295  0.574922  0.872633  0.175556  0.557064  0.645949
296  0.682334  0.737660  0.414143  0.886655  0.328290
297  0.716609  0.729085  0.383762  0.515982  0.705994
298  0.909928  0.693864  0.268478  0.449283  0.530372
299  0.477445  0.559348  0.186028  0.367023  0.500859

[300 rows x 5 columns]

changing column names:

In [48]:
new_df.columns=list("ABCDE")
new_df.head()

          A         B         C         D         E
0     hello  0.089835  0.847709  0.951521  0.161630
1  TANISHKA  0.638972  0.481751  0.638470  0.192245
2  0.879449  0.899123  0.509577  0.872960  0.893401
3  0.492929  0.910274  0.098391  0.691656  0.346590
4  0.947001  0.793172  0.769571  0.535454  0.567428

In [49]:
new_df.loc[0,0]="yuhu"      # will create another column named 0 since it does'nt exist
new_df.head()

          A         B         C         D         E     0
0     hello  0.089835  0.847709  0.951521  0.161630  yuhu
1  TANISHKA  0.638972  0.481751  0.638470  0.192245   NaN
2  0.879449  0.899123  0.509577  0.872960  0.893401   NaN
3  0.492929  0.910274  0.098391  0.691656  0.346590   NaN
4  0.947001  0.793172  0.769571  0.535454  0.567428   NaN

DROPPING A COLUMN:
1) WE CAN USE DROP() FUNCTION BUT KEEP IN MIND IT DOES NOT DROP THE COLUMN FROM THE ORIGINAL DATAFRAME. IT DREATES A COPY AND THEN DOES IT SO WE HAVE TO ASSIGN IT TO ANOTHER VARIABLE TO EXTRACT THE MODIFIED DATAFRAME.
2) IF WE DONT'T WANT TO REASSIGN THEN WE CAN ALSO USE THE INPLACE = True IN THE ARFUEMENT TO ACTUALLY REPLACE THE VALUE BUT IT IS NOT ADVISED

In [50]:
new_df.drop(0, axis=1)     # actual dataframe is not being changed 
new_df.head()              # therefore actual dataframe is being printed

          A         B         C         D         E     0
0     hello  0.089835  0.847709  0.951521  0.161630  yuhu
1  TANISHKA  0.638972  0.481751  0.638470  0.192245   NaN
2  0.879449  0.899123  0.509577  0.872960  0.893401   NaN
3  0.492929  0.910274  0.098391  0.691656  0.346590   NaN
4  0.947001  0.793172  0.769571  0.535454  0.567428   NaN

In [51]:
print(new_df.drop(0,axis=1))    # prints the changed dataframe

            A         B         C         D         E
0       hello  0.089835  0.847709  0.951521  0.161630
1    TANISHKA  0.638972  0.481751  0.638470  0.192245
2    0.879449  0.899123  0.509577  0.872960  0.893401
3    0.492929  0.910274  0.098391  0.691656  0.346590
4    0.947001  0.793172  0.769571  0.535454  0.567428
..        ...       ...       ...       ...       ...
295  0.574922  0.872633  0.175556  0.557064  0.645949
296  0.682334  0.737660  0.414143  0.886655  0.328290
297  0.716609  0.729085  0.383762  0.515982  0.705994
298  0.909928  0.693864  0.268478  0.449283  0.530372
299  0.477445  0.559348  0.186028  0.367023  0.500859

[300 rows x 5 columns]

In [52]:
new_df=new_df.drop(0, axis=1)              #  Permanently deletes the col
new_df

            A         B         C         D         E
0       hello  0.089835  0.847709  0.951521  0.161630
1    TANISHKA  0.638972  0.481751  0.638470  0.192245
2    0.879449  0.899123  0.509577  0.872960  0.893401
3    0.492929  0.910274  0.098391  0.691656  0.346590
4    0.947001  0.793172  0.769571  0.535454  0.567428
..        ...       ...       ...       ...       ...
295  0.574922  0.872633  0.175556  0.557064  0.645949
296  0.682334  0.737660  0.414143  0.886655  0.328290
297  0.716609  0.729085  0.383762  0.515982  0.705994
298  0.909928  0.693864  0.268478  0.449283  0.530372
299  0.477445  0.559348  0.186028  0.367023  0.500859

[300 rows x 5 columns]

In [53]:
new_df.loc[0,'F'] = "WALLAH"     #  ADDING ANOTHER COLUMN
new_df

            A         B         C         D         E       F
0       hello  0.089835  0.847709  0.951521  0.161630  WALLAH
1    TANISHKA  0.638972  0.481751  0.638470  0.192245     NaN
2    0.879449  0.899123  0.509577  0.872960  0.893401     NaN
3    0.492929  0.910274  0.098391  0.691656  0.346590     NaN
4    0.947001  0.793172  0.769571  0.535454  0.567428     NaN
..        ...       ...       ...       ...       ...     ...
295  0.574922  0.872633  0.175556  0.557064  0.645949     NaN
296  0.682334  0.737660  0.414143  0.886655  0.328290     NaN
297  0.716609  0.729085  0.383762  0.515982  0.705994     NaN
298  0.909928  0.693864  0.268478  0.449283  0.530372     NaN
299  0.477445  0.559348  0.186028  0.367023  0.500859     NaN

[300 rows x 6 columns]

In [54]:
new_df.drop('F',axis=1, inplace=True)    #actually drops from the real dataframe as well
new_df

            A         B         C         D         E
0       hello  0.089835  0.847709  0.951521  0.161630
1    TANISHKA  0.638972  0.481751  0.638470  0.192245
2    0.879449  0.899123  0.509577  0.872960  0.893401
3    0.492929  0.910274  0.098391  0.691656  0.346590
4    0.947001  0.793172  0.769571  0.535454  0.567428
..        ...       ...       ...       ...       ...
295  0.574922  0.872633  0.175556  0.557064  0.645949
296  0.682334  0.737660  0.414143  0.886655  0.328290
297  0.716609  0.729085  0.383762  0.515982  0.705994
298  0.909928  0.693864  0.268478  0.449283  0.530372
299  0.477445  0.559348  0.186028  0.367023  0.500859

[300 rows x 5 columns]

WE CAN ALSO PASS EXPRESSIONS AND CONSITIONS IN LOC FUNCTION:

Below will return all rows whose 'E' column is greater than 0.5

In [55]:
new_df.loc[(new_df['E']>0.5)]

            A         B         C         D         E
2    0.879449  0.899123  0.509577  0.872960  0.893401
4    0.947001  0.793172  0.769571  0.535454  0.567428
7    0.094872  0.278687  0.326663  0.956544  0.765066
8     0.34016  0.397954  0.321997  0.498540  0.662637
11   0.811764  0.707185  0.548679  0.526610  0.924870
..        ...       ...       ...       ...       ...
294  0.081684  0.377024  0.770937  0.022749  0.945536
295  0.574922  0.872633  0.175556  0.557064  0.645949
297  0.716609  0.729085  0.383762  0.515982  0.705994
298  0.909928  0.693864  0.268478  0.449283  0.530372
299  0.477445  0.559348  0.186028  0.367023  0.500859

[142 rows x 5 columns]

In [56]:
new_df.loc[(new_df['E']>0.5), (new_df['B']<0.5)]   # DOESN'T WORK LIKE THAT ( WE CAN PROVIDE CONDITIONS BUT NOT CONDITION FOR ROW AND COL AS ARGUEMENT)

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

In [ ]:
new_df.loc[(new_df['B']>0.5) & (new_df['C']<0.4)]

            A         B         C         D         E
6     0.19965  0.706561  0.102458  0.634597  0.481915
8    0.730011  0.628742  0.272649  0.306955  0.499755
15   0.868555  0.898784  0.263345  0.850245  0.443698
19   0.448037  0.565281  0.282513  0.859857  0.434528
20   0.059667  0.611697  0.109615  0.173586  0.162900
..        ...       ...       ...       ...       ...
287  0.778113  0.974445  0.325832  0.874675  0.432572
288  0.772798  0.668587  0.237577  0.457078  0.901082
289  0.513854  0.664489  0.097524  0.008676  0.128138
298  0.371522  0.595363  0.198635  0.376591  0.748060
299  0.731253  0.936805  0.064255  0.437152  0.032759

[63 rows x 5 columns]

INSTEAD OF USING ROW AND COLUMN NAMES WE CAN ALSO USE ILOC FUNCTIONS WHICH USES INDEX VALUES FOR BOTH ROW AND COLUMN

In [ ]:
new_df.iloc[[0,1], [3,4]]

          D         E
0  0.249112  0.304014
1  0.275858  0.198242

In [ ]:
new_df.drop(['A','B'], axis=1, inplace=True)

In [ ]:
new_df    #column dropeed

            C         D         E
0    0.174683  0.249112  0.304014
1    0.705252  0.275858  0.198242
2    0.671802  0.561317  0.883623
3    0.301620  0.352064  0.248534
4    0.922901  0.184172  0.100190
..        ...       ...       ...
295  0.184722  0.758849  0.287532
296  0.856406  0.184996  0.597715
297  0.812019  0.513303  0.860054
298  0.198635  0.376591  0.748060
299  0.064255  0.437152  0.032759

[300 rows x 3 columns]

In [ ]:
new_df.drop([0,3],axis=0, inplace=True)    # but indexing is ruined 
new_df

            C         D         E
1    0.705252  0.275858  0.198242
2    0.671802  0.561317  0.883623
4    0.922901  0.184172  0.100190
5    0.775650  0.749900  0.711108
6    0.102458  0.634597  0.481915
..        ...       ...       ...
295  0.184722  0.758849  0.287532
296  0.856406  0.184996  0.597715
297  0.812019  0.513303  0.860054
298  0.198635  0.376591  0.748060
299  0.064255  0.437152  0.032759

[298 rows x 3 columns]

In [ ]:
new_df.reset_index(inplace=True )    #WILL ACTUALLY HAPPEN IN THE ORIGINAL DATAFRAME AS WELL but our index is added as a col
new_df                               # To avoid this we can use drop=true to drop the index col

In [ ]:
new_df.reset_index(inplace=True , drop=True)    #our newly added index, after reseting is not added as another column.
new_df

     level_0  index         C         D         E
0          0      1  0.705252  0.275858  0.198242
1          1      2  0.671802  0.561317  0.883623
2          2      4  0.922901  0.184172  0.100190
3          3      5  0.775650  0.749900  0.711108
4          4      6  0.102458  0.634597  0.481915
..       ...    ...       ...       ...       ...
293      293    295  0.184722  0.758849  0.287532
294      294    296  0.856406  0.184996  0.597715
295      295    297  0.812019  0.513303  0.860054
296      296    298  0.198635  0.376591  0.748060
297      297    299  0.064255  0.437152  0.032759

[298 rows x 5 columns]

In [ ]:
new_df.loc[[2,4,6] , 'C']= 0
new_df.head(7)

   level_0  index         C         D         E    B    c
0        0      1  0.705252  0.275858  0.198242  NaN  NaN
1        1      2  0.671802  0.561317  0.883623  NaN  NaN
2        2      4  0.000000  0.184172  0.100190  0.0  0.0
3        3      5  0.775650  0.749900  0.711108  NaN  NaN
4        4      6  0.000000  0.634597  0.481915  0.0  0.0
5        5      7  0.462066  0.471853  0.852254  NaN  NaN
6        6      8  0.000000  0.306955  0.499755  0.0  0.0

In [ ]:
new_df.drop(["index","level_0"] , axis=1 , inplace=True)
new_df

            C         D         E
0    0.705252  0.275858  0.198242
1    0.671802  0.561317  0.883623
2    0.000000  0.184172  0.100190
3    0.775650  0.749900  0.711108
4    0.000000  0.634597  0.481915
..        ...       ...       ...
293  0.184722  0.758849  0.287532
294  0.856406  0.184996  0.597715
295  0.812019  0.513303  0.860054
296  0.198635  0.376591  0.748060
297  0.064255  0.437152  0.032759

[298 rows x 3 columns]

In [ ]:
new_df['C'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
293    False
294    False
295    False
296    False
297    False
Name: C, Length: 298, dtype: bool

THEREFORE, VALUE 0 DOES NOT MEAN NULL. NULL MEANS THERE IS NO VALUES AND CAN BE ASSIGNED USING NONE

In [ ]:
new_df.loc[[2,4,6] , 'C'] = None

In [ ]:
new_df

            C         D         E
0    0.705252  0.275858  0.198242
1    0.671802  0.561317  0.883623
2         NaN  0.184172  0.100190
3    0.775650  0.749900  0.711108
4         NaN  0.634597  0.481915
..        ...       ...       ...
293  0.184722  0.758849  0.287532
294  0.856406  0.184996  0.597715
295  0.812019  0.513303  0.860054
296  0.198635  0.376591  0.748060
297  0.064255  0.437152  0.032759

[298 rows x 3 columns]

In [ ]:
new_df['C'].isnull()

0      False
1      False
2       True
3      False
4       True
       ...
293    False
294    False
295    False
296    False
297    False
Name: C, Length: 298, dtype: bool

In [ ]:
new_df.loc[: , 'B'] = None

In [ ]:
new_df['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
293    True
294    True
295    True
296    True
297    True
Name: B, Length: 298, dtype: bool

PLAYING WITH NULL VALUES:

In [ ]:
df= pd.DataFrame({
    "NAME" : ["akash","prem","payal","madhu"],
    "AGE" : [np.nan, np.nan , 19 , 20],
    "DOB": [ pd.NaT , pd.Timestamp(" 25 - 11 - 2003") , pd.Timestamp(" 06- 09 - 2004") , pd.NaT ]})
df

    NAME   AGE        DOB
0  akash   NaN        NaT
1   prem   NaN 2003-11-25
2  payal  19.0 2004-06-09
3  madhu  20.0        NaT

In [ ]:
df.dropna()     # Default axis=0. Therefore it drops rows with nan

    NAME   AGE        DOB
2  payal  19.0 2004-06-09

In [ ]:
df

    NAME   AGE        DOB
0  akash   NaN        NaT
1   prem  21.0        NaT
2  payal  19.0 2004-06-09
3  madhu  20.0        NaT

DROPPING COLUMNS WITH NULL VALUES:

In [ ]:
df.dropna(axis=1)     # drops col with even a single nan value

    NAME
0  akash
1   prem
2  payal
3  madhu

DROPPING ROWS WITH  ALL VALUE AS NULL:

In [ ]:
df.dropna(how="all")      # how="all" --> drops where all value is nan

    NAME   AGE        DOB
0  akash   NaN        NaT
1   prem   NaN 2003-11-25
2  payal  19.0 2004-06-09
3  madhu  20.0        NaT

In [ ]:
df.dropna(how="any")    # how="any" --> drops where even a single value is nan ( how= any and axis = 0  is the default setting for dropping)

    NAME   AGE        DOB
2  payal  19.0 2004-06-09

DROPPING COLUMNS WITH ALL VALUE AS NULL:

In [ ]:
df.dropna(axis = 1 , how="all")   # drops col where all values are nan

    NAME   AGE        DOB
0  akash   NaN        NaT
1   prem   NaN 2003-11-25
2  payal  19.0 2004-06-09
3  madhu  20.0        NaT

In [ ]:
df.dropna(axis=1, how="any")   # drops the column where even a single value is nan

    NAME
0  akash
1   prem
2  payal
3  madhu

In [ ]:
df

    NAME   AGE        DOB
0  akash   NaN        NaT
1   prem   NaN 2003-11-25
2  payal  19.0 2004-06-09
3  madhu  20.0        NaT

DROPPING ROWS WHERE ONLY A CERTAIN COLUMN IS nan USING SUBSET:
UNDERSTAND AXIS ( SUM AND DROP SHOW DIFFERENT FUNCTIONALITY. WHY?)
WILL DO LATER

In [ ]:
df.dropna(subset=["AGE"])

    NAME   AGE        DOB
2  payal  19.0 2004-06-09
3  madhu  20.0        NaT

In [ ]:
df.dropna(subset= ["AGE" , "DOB" ])    # DROPS ROWS WHERE EITHER AGE OR DOB IS NAN

    NAME   AGE        DOB
2  payal  19.0 2004-06-09

DROPPING DUPLICATES:

In [57]:
df.head()

            name  marks      city
FIRST   tanishka    100     delhi
SECOND      doll     97    rampur
THIRD      payal     99  nagaland
FOURTH     madhu    100        us

In [58]:
df.iloc[0,0]="doll"

In [59]:
df.iloc[0,1]=97

In [60]:
df.iloc[0,2]="rampur"

In [61]:
df

         name  marks      city
FIRST    doll     97    rampur
SECOND   doll     97    rampur
THIRD   payal     99  nagaland
FOURTH  madhu    100        us

dropping duplicate rows

In [ ]:
df.drop_duplicates()       # default --> keep="first"  ( keeps the first duplicate and drops the rest)

         name  marks      city
FIRST    doll     97    rampur
THIRD   payal     99  nagaland
FOURTH  madhu    100        us

In [63]:
df

         name  marks      city
FIRST    doll     97    rampur
SECOND   doll     97    rampur
THIRD   payal     99  nagaland
FOURTH  madhu    100        us

In [ ]:
df.drop_duplicates(keep="last")   #keeps the last duplicate and deletes the rest

         name  marks      city
SECOND   doll     97    rampur
THIRD   payal     99  nagaland
FOURTH  madhu    100        us

In [69]:
df.drop_duplicates(keep=False)

         name  marks      city
THIRD   payal     99  nagaland
FOURTH  madhu    100        us

In [70]:
df

         name  marks      city
FIRST    doll     97    rampur
SECOND   doll     97    rampur
THIRD   payal     99  nagaland
FOURTH  madhu    100        us

DROPPING DUPLICATE COLUMNS:

In [ ]:
df.drop_duplicates(subset=["name"])    #deletes row with same name

         name  marks      city
FIRST    doll     97    rampur
THIRD   payal     99  nagaland
FOURTH  madhu    100        us

In [72]:
df

         name  marks      city
FIRST    doll     97    rampur
SECOND   doll     97    rampur
THIRD   payal     99  nagaland
FOURTH  madhu    100        us

In [73]:
df.info

<bound method DataFrame.info of          name  marks      city
FIRST    doll     97    rampur
SECOND   doll     97    rampur
THIRD   payal     99  nagaland
FOURTH  madhu    100        us>

COUNTING NUMBER OF VALUES IN A COLUMN:

In [75]:
df['name'].value_counts()

name
doll     2
payal    1
madhu    1
Name: count, dtype: int64

In [77]:
df['name'].value_counts(ascending=True)

name
payal    1
madhu    1
doll     2
Name: count, dtype: int64

In [78]:
df['name'].value_counts(dropna=True)   #drops na value else conts that too

name
doll     2
payal    1
madhu    1
Name: count, dtype: int64

CHECKING FOR NULL VALUES:

In [82]:
df.isnull()

         name  marks   city
FIRST   False  False  False
SECOND  False  False  False
THIRD   False  False  False
FOURTH  False  False  False

In [83]:
df.notnull()

        name  marks  city
FIRST   True   True  True
SECOND  True   True  True
THIRD   True   True  True
FOURTH  True   True  True

TO CONVERT EXCEL FILE INTO A DATAFRAME AND VICE - VERSA:

In [91]:
data=pd.read_excel('RESEARCH INTERNSHIP.xlsx')
data.head()

,RESEARCH INTERSHIP,COUNTRY,FEE,STIPEND,Mail/form,APPLYING DATE,DEADLINE,DURATION,EXACT DATE,WHICH SEM?,APPLIED? Y/N,RESULT,Travel,ACCOMODATION,LIVING EXP.,HEALTH INS.,FIELD,PROF. MAIL
0,Isternship Ista summer fellowship,"Vienna,Austria",NaN,1150 euro,FORM,START - DEC,NOT DISCLOSED,2-3 MOS,May 15¬†-¬†Sept 15(NF),3RD AND 4TH YEAR,NaN,NaN,round-trip,On-camp (partialy paid),NaN,assist,NaN,NaN
1,Ista Year round internship,"Vienna,Austria",NO,1530 Euro,MAIL,YEAR ROUND,YEAR ROUND,upto 1 year,NaN,3RD & 4TH,NaN,NaN,NaN,On-camp (partialy paid),NaN,NaN,NaN,NaN
2,KAUST VSRP Internship,Saudi arabia,NO,1000$,FORM,YEAR ROUND,-,3 - 6 MOS,NaN,3rd & 4TH YEAR,NaN,NaN,round-trip,OC Private Bed+bath,NaN,no,NaN,NaN
3,RIPS - UCLA,"LA, US",NO,4200$,FORM,NOT DECLARED,In feb,2 MOS,June 24 ‚Äì August 23,3rd & 4th year,NaN,NaN,round trip,OC DORM,NaN,NaN,NaN,NaN
4,CERN,"geneva,Switzer",NO,93CHF/Day,FORM,nov(tentative),26 jan (tentative),9 weeks,june-aug,3rd & 4th,NaN,NaN,round trip,nope(stipend),NaN,yes,NaN,NaN

In [ ]:
df.to_excel('df.xlsx')   # converts dataframe to excel sheet

In [94]:
df

         name  marks      city
FIRST    doll     97    rampur
SECOND   doll     97    rampur
THIRD   payal     99  nagaland
FOURTH  madhu    100        us

HOMEWORK:

In [101]:
df=pd.DataFrame( np.random.randint(10, size=(3,2)) )
df

   0  1
0  1  3
1  1  8
2  9  4

In [103]:
df.describe()

              0         1
count  3.000000  3.000000
mean   3.666667  5.000000
std    4.618802  2.645751
min    1.000000  3.000000
25%    1.000000  3.500000
50%    1.000000  4.000000
75%    5.000000  6.000000
max    9.000000  8.000000

In [ ]:
df.mean()    #finds mean of 1 and 2 column

0    3.666667
1    5.000000
dtype: float64

In [106]:
df.corr()    #CHECKS CORRELATION BETWEEN TWO VARIABLE

          0         1
0  1.000000 -0.327327
1 -0.327327  1.000000

In [108]:
df

   0  1
0  1  3
1  1  8
2  9  4

In [110]:
df.count()

0    3
1    3
dtype: int64

In [ ]:
df.count(axis=1)

0    2
1    2
2    2
dtype: int64

In [111]:
df.max()

0    9
1    8
dtype: int32

In [112]:
df.min()

0    1
1    3
dtype: int32

In [113]:
df.mean()

0    3.666667
1    5.000000
dtype: float64

In [114]:
df.std()

0    4.618802
1    2.645751
dtype: float64

In [115]:
df.median()

0    1.0
1    4.0
dtype: float64

In [116]:
df

   0  1
0  1  3
1  1  8
2  9  4